In [1]:
import sqlite3
import pandas as pd

In [2]:
# define connection and cursor
conn = sqlite3.connect('store_transactions.db')
c = conn.cursor()

In [3]:
#create table stores
create_table_1 = """
CREATE TABLE IF NOT EXISTS stores
(
    store_id    INTEGER   PRIMARY KEY, 
    location    TEXT      NOT NULL, -- variable length: string (slow), Also VARCHAR
    brand       CHAR(6)   NOT NULL -- fixed length: string
);
"""

create_table_2 = """
CREATE TABLE IF NOT EXISTS purchases
(
    purchase_id     INTEGER         PRIMARY KEY, 
    store_id        INTEGER         NOT NULL, 
    units_ordered   INTEGER         NOT NULL,
    unit_price      DECIMAL(6,2)    NOT NULL,
    FOREIGN KEY(store_id) REFERENCES stores(store_id)
);
"""
c.execute(create_table_1)
c.execute(create_table_2)

In [4]:
#add to stores
insertrows_stores = """
INSERT INTO stores
    (store_id, location, brand)
VALUES 
    (21, 'Minneapolis, MN', 'brand1'),
    (95, 'Chicago, IL', 'brand2'),
    (64, 'Iowa City, IA', 'brand33');
"""

insertrows_purchases = """
INSERT INTO purchases
    (purchase_id, store_id, units_ordered, unit_price)
VALUES 
    (54, 21,  6, 15.4),
    (23, 64,  2, 21.2),
    (4,  21, 55, 16.4),
    (5,  21, 63, 14.7),
    (47, 95, 10, 11.5),
    (65, 95, 16, 19.3);
"""

c.execute(insertrows_stores)
c.execute(insertrows_purchases)

In [5]:
#get results
pd.read_sql_query("SELECT * FROM stores", conn)

   store_id         location    brand
0        21  Minneapolis, MN   brand1
1        64    Iowa City, IA  brand33
2        95      Chicago, IL   brand2

In [6]:
#update
update_cell = """
UPDATE purchases
SET unit_price = 3.67 
WHERE purchase_id = 54
"""
retrieve = """
SELECT * FROM purchases
LIMIT 5;
"""

c.execute(update_cell)
pd.read_sql_query(retrieve, conn)

   purchase_id  store_id  units_ordered  unit_price
0            4        21             55       16.40
1            5        21             63       14.70
2           23        64              2       21.20
3           47        95             10       11.50
4           54        21              6        3.67

In [7]:
conn.commit()
conn.close()